# CellValue

## Description
Function CellValue returns the numeric value of a specified cell in the active worksheet. If the specified cell is not a numeric type, then this function returns 0.

```pascal
FUNCTION CellValue(
				row    : INTEGER;
				column : INTEGER): REAL;
```

```python
def vs.CellValue(row, column):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|row|INTEGER|Worksheet row index.|
|column|INTEGER|Worksheet column index.|

## Remarks
Returns the floating point representation of the current worksheet's cell specified by &quot;row&quot; and &quot;column&quot; numbers.  If the specified cell is not a numeric type, then this function returns 0. [sd 8/13/98]

## Examples
```pascal
resultVal := CellValue(1, 2);
```
```python
import vs

# Function CellValue returns the numeric value of a specified cell in the
# active worksheet.
row = 10
column = 5

value = vs.CellValue(row, column)
vs.Message('CellValue returned: ' + str(value))
```

## See Also
GetWSCellValue, GetWSSubrowCellValue

## Version
CellValue is obsolete as of VectorWorks 9.0, see GetWSCellValue, GetWSSubrowCellValue

Availability: from All Versions

## Category
* Worksheets